# coding: utf-8
import cv2
import numpy as np
from scipy.stats import kurtosis, skew
def detect_gaussian_salt_pepper_noise(image):
    
    # ابتدا انحراف معیار کل تصویر را محاسبه کنید. اگر مقدار انحراف معیار از 20 کمتر بود احتمالا تصویر نویز ندارد
    std_dev = np.std(image)

    # بررسی نویز نمک‌فلفل: پیکسل‌های شدید (0 یا 255)
    # برای بررسی نویز فلفل نمک باید تمام پیکسل های تصویر را محاسبه کرد یعنی چند پیکسل دارد تصویر
    total_pixels = image.size
    # حال مجموع تعداد پیکسل های با مقادیر 0 یا 255 را با هم محاسبه و جمع میکنیم. یعنی مجموعا چند پیکسل داریم که مقادیر شدت روشنایی انها 0 یا 255 هستند
    extreme_pixels = np.sum((image == 0) | (image == 255))
   
    if extreme_pixels / total_pixels > 0.005:
        return "Salt-and-Pepper"

    # نسبت پیکسل های مقادیر 0 یا 255 به کل پیکسل های تصویر اگر بیشتر از 0.005 باشد احتمالا تصویر نویز فلفل و نمک دارد.
    

    # \به عنوان تمرین، چگونگی اینکه تصویر نویز گوسی دارد یا خیر را الگوریتمش را شما بنویسید
    if std_dev >20:
        return "Gaussian"


    # اگر هیچ‌کدام مشخص نشد، فرض می‌کنیم نویز ندارد (برای سادگی)
    return "No Noise"
